#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//int main()
//{
//	//int n = 9;
//	//float* pFloat = (float*)&n;
//	//printf("n的值为：%d\n",n);
//	//printf("*pFloat的值为：%f\n", *pFloat);
//
//	//*pFloat = 9.0;
//	//printf("n的值为：%d\n", n);
//	//printf("*pFloat的值为：%f\n", *pFloat);//整型和浮点型的存储方式不同
//
//	float n = 5.5;
//	//101.1
//	//s=0
//	//m=1.011
//	//e=2
//	//01000000 10110000 00000000 00000000
//	//0x40 b0 00 00
//	return 0;
//}
//int main()
//{
//	int i = -20;
//	//10000000 00000000 00000000 00010100
//	//11111111 11111111 11111111 11101011
//	//11111111 11111111 11111111 11101100
//
//	unsigned int j = 10;
//	//00000000 00000000 00000000 00001010
//
//	//i+j
//	//11111111 11111111 11111111 11110110
//	//11111111 11111111 11111111 11110101
//	//10000000 00000000 00000000 00001010
//	printf("%d\n", i + j);
//	return 0;
//}
//int main()
//{
//	char a = -128;
//	//10000000 00000000 00000000 10000000
//	//11111111 11111111 11111111 01111111
//	//11111111 11111111 11111111 10000000
//	//10000000
//	//11111111 11111111 11111111 10000000
//	printf("%u\n", a);//%u十进制无符号数字
//	return 0;
//}
//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//	//char* p = (char*)&a;
//	////返回1 小端
//	////返回2 大端
//	//return *p;
//	//if (*p == 1)
//	//	return 1;
//	//else
//	//	return 0;
//}
//int main()
//{
//	int a = 20;
//	//返回1，小端
//	//返回0，大端
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//
//}
//判断字节序
//int main()
//{
//	int a = 1;
//	char* p = &a;
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}
//int main()
//{
//	int a = 20;
//	//00000000 00000000 00000000 00010100 原码
//	//00000000 00000000 00000000 00010100 反码
//	//00000000 00000000 00000000 00010100 补码
//	//00 00 00 14
//	int b = -10;
//	//10000000 00000000 00000000 00001010 原码
//	//11111111 11111111 11111111 11110101 反码
//	//11111111 11111111 11111111 11110110 补码
//	//ff ff ff f6
//	return 0;
//}
//int main()
//{
//	int a = 10;
//	float f = 10.0;
//	return 0;
//}
//void my_strcpy(char* arr, char* arr2)
//{
//	int i = 0;
//	do
//	{
//		*(arr + i) = *(arr2 + i);
//		i++;
//	} while (*(arr+i) != '\0');
//}
//int main()
//{
//	//strcpy
//	//字符拷贝
//	char arr[] = "################";
//	char arr2[] = "bit";
//	my_strcpy(arr, arr2);
//	printf("%s\n", arr);
//	return 0;
//}